In [1]:
from sqlalchemy import create_engine, text
import pandas as pd
import pandas as pd  
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

In [2]:
database_name = 'scooters'    # Fill this in with your lahman database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [3]:
engine = create_engine(connection_string)

In [4]:
query = '''
SELECT *
FROM scooters
LIMIT 100
'''
with engine.connect() as connection:
    result = connection.execute(text(query))

In [5]:
with engine.connect() as connection:
    scooters = pd.read_sql(text(query), con = connection)
scooters.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-13 03:21:18.917,36.126428,-86.848040,PoweredNGPEGO2TF367W,Powered,73.0,scooter,0.0,Lime
1,2019-05-13 03:21:18.917,36.176328,-86.748095,PoweredLGCQYN2BOBMWI,Powered,84.0,scooter,0.0,Lime
2,2019-05-13 03:21:18.917,36.029567,-86.567623,PoweredEE2HRZ3ZRFM5O,Powered,29.0,scooter,0.0,Lime
3,2019-05-13 03:21:18.917,36.174590,-86.785974,PoweredMKJGWYG7K6BNS,Powered,7.0,scooter,0.0,Lime
4,2019-05-13 03:21:18.917,36.121326,-86.783362,PoweredBPB2NKRCMJ6R4,Powered,78.0,scooter,0.0,Lime

In [6]:
scooters.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   pubdatetime  100 non-null    datetime64[ns]
 1   latitude     100 non-null    float64
 2   longitude    100 non-null    float64
 3   sumdid       100 non-null    object
 4   sumdtype     100 non-null    object
 5   chargelevel  100 non-null    float64
 6   sumdgroup    100 non-null    object
 7   costpermin   100 non-null    float64
 8   companyname  100 non-null    object
dtypes: datetime64[ns](1), float64(4), object(4)
memory usage: 7.2+ KB

In [7]:
query = '''
SELECT companyname, Count(*)
FROM scooters 
group by companyname;
'''
counts = pd.read_sql_query(query, engine)
counts

  companyname     count
0        Bird  12251590
1        Bolt   3477198
2      Gotcha   4679280
3        Jump  21835098
4        Lime  16524261
5        Lyft   9087043
6        Spin   5559573

In [8]:
TRIP = '''
SELECT *
FROM TRIPS 
LIMIT 100
'''
TRIPSVAL = pd.read_sql_query(TRIP, engine)
TRIPSVAL.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [9]:
SUMIDS = '''
SELECT SUMDID
FROM trips
GROUP BY SUMDID
ORDER BY SUMDID
'''
SUMIDSTRIP = pd.read_sql_query(SUMIDS, engine)
SUMIDSTRIP

                                            sumdid
0     Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619
1     Powered-01a24436-0315-e1bb-7ce0-d081d05dff7d
2     Powered-03be23ca-d43b-222f-be54-e44b5b4690df
3     Powered-046201fb-6532-1f37-6334-3612fb1e61f7
4     Powered-0479bb84-afbd-0426-f1c4-df628542a88c
...                                            ...
9000                                  PoweredZZFGD
9001                          PoweredZZNTWU4QI7MLI
9002                          PoweredZZQ7FMUUD6ULV
9003                          PoweredZZQOO54WD4AJT
9004                         StandardLIRPOZ7X3ZVGO

[9005 rows x 1 columns]

In [10]:
MINLATLON = '''
SELECT 'SCOOTER'TABLE_NAME,MIN(latitude) MIN_LAT,MAX(latitude) MAX_LAT,MIN(longitude) MIN_LON, MAX(longitude) MAX_LON 
FROM scooters 
UNION 
SELECT 'TRIPS'TABLE_NAME, MIN(startlatitude) MIN_LAT,MAX(endlatitude) MAX_LAT,MIN(endlongitude) MIN_LON, MAX(endlongitude) MAX_LON 
FROM trips 
'''
LATLON = pd.read_sql_query(MINLATLON, engine)
LATLON

  table_name  min_lat       max_lat     min_lon     max_lon
0    SCOOTER   0.0000  3.609874e+06  -97.443879    0.000000
1      TRIPS  35.8532  5.104541e+01 -122.673729  174.764886

In [11]:
SUMGRP ='''
SELECT SUMDGROUP
FROM scooters 
GROUP BY SUMDGROUP
'''

GROUPTYPE = pd.read_sql_query(SUMGRP, engine)
GROUPTYPE

  sumdgroup
0   bicycle
1   scooter
2   Scooter

1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?

1A. How many scooters did each company have in this time frame

In [12]:
TOTALSCOOTERS = '''
SELECT COMPANYNAME,
COUNT(DISTINCT(SUMDID)) COUNTS
FROM scooters
WHERE UPPER(SUMDGROUP) = 'SCOOTER'
GROUP BY
COMPANYNAME
'''
SCOOTERCOUNT = pd.read_sql_query(TOTALSCOOTERS, engine)
SCOOTERCOUNT

  companyname  counts
0        Bird    3860
1        Bolt     360
2      Gotcha     224
3        Jump    1210
4        Lime    1818
5        Lyft    1735
6        Spin     805

In [13]:
1B. Did the number for each company change over time?

In [17]:
JUSTSCOOTERS1 = '''
SELECT 
UPPER(SUMDGROUP) SUMDGROUP,
UPPER(COMPANYNAME) COMPANYNAME,
TO_CHAR(PUBDATETIME,'MM') MONTH_NUM,
TO_CHAR(PUBDATETIME,'MONTH') MONTH_NAME,
TO_CHAR(PUBDATETIME,'YYYY') YEAR_VAL,
COUNT(DISTINCT(SUMDID))
FROM SCOOTERS TABLESAMPLE SYSTEM (1)
WHERE 
UPPER(SUMDGROUP) = 'SCOOTER'
GROUP BY
UPPER(COMPANYNAME),
UPPER(SUMDGROUP),
TO_CHAR(PUBDATETIME,'MM'),
TO_CHAR(PUBDATETIME,'MONTH'),
TO_CHAR(PUBDATETIME,'YYYY')
ORDER BY
UPPER(COMPANYNAME),
UPPER(SUMDGROUP),
TO_CHAR(PUBDATETIME,'MM'),
TO_CHAR(PUBDATETIME,'MONTH'),
TO_CHAR(PUBDATETIME,'YYYY')
'''

SCOOTERSONLY1 = pd.read_sql_query(JUSTSCOOTERS1 , engine)
SCOOTERSONLY1

   sumdgroup companyname month_num month_name year_val  count
0    SCOOTER        BIRD        05  MAY           2019   2945
1    SCOOTER        BIRD        06  JUNE          2019   2820
2    SCOOTER        BIRD        07  JULY          2019   2467
3    SCOOTER        BOLT        05  MAY           2019    344
4    SCOOTER        BOLT        06  JUNE          2019    328
5    SCOOTER        BOLT        07  JULY          2019    273
6    SCOOTER      GOTCHA        05  MAY           2019    223
7    SCOOTER      GOTCHA        06  JUNE          2019    223
8    SCOOTER      GOTCHA        07  JULY          2019    224
9    SCOOTER        JUMP        05  MAY           2019    976
10   SCOOTER        JUMP        06  JUNE          2019   1036
11   SCOOTER        JUMP        07  JULY          2019   1206
12   SCOOTER        LIME        05  MAY           2019   1610
13   SCOOTER        LIME        06  JUNE          2019   1437
14   SCOOTER        LIME        07  JULY          2019    867
15   SCOOTER        LYFT        05  MAY           2019   1348
16   SCOOTER        LYFT        06  JUNE          2019   1127
17   SCOOTER        LYFT        07  JULY          2019   1004
18   SCOOTER        SPIN        05  MAY           2019    659
19   SCOOTER        SPIN        06  JUNE          2019    702
20   SCOOTER        SPIN        07  JULY          2019    548

1C. Did scooter usage vary by company?

In [15]:
TRIPSTESTSPEED ='''
SELECT *
FROM TRIPS TABLESAMPLE SYSTEM (1)
'''
SPEEDTESTTRIP= pd.read_sql_query(TRIPSTESTSPEED , engine)
SPEEDTESTTRIP

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 19:51:48.433,Bird,BRD1105,PoweredA8YN4,32.0,16404.20000,2019-05-01,19:21:24.453333,2019-05-01,19:53:30.076666,36.150100,-86.813400,36.165100,-86.775900,"[(36.150127, -86.813499), (36.149998, -86.8134...",2019-05-02 05:31:15.643
1,2019-05-01 19:51:48.433,Bird,BRD1098,PoweredQ51H4,5.0,3937.00800,2019-05-01,19:46:55.300000,2019-05-01,19:52:24.730000,36.160800,-86.781200,36.154400,-86.787000,"[(36.160682, -86.781721), (36.160682, -86.7817...",2019-05-02 05:31:15.430
2,2019-05-01 19:51:48.433,Bird,BRD1103,PoweredZJKN6,20.0,8330.05276,2019-05-01,19:33:28.206666,2019-05-01,19:53:06.416666,36.150100,-86.792800,36.160300,-86.775300,"[(36.15012, -86.792786), (36.15012, -86.792786...",2019-05-02 05:31:15.580
3,2019-05-01 19:51:48.433,Bird,BRD1100,PoweredCJJJE,10.0,3937.00800,2019-05-01,19:43:29.850000,2019-05-01,19:53:09.760000,36.156400,-86.776300,36.150300,-86.780900,"[(36.156565, -86.776265), (36.156486, -86.7757...",2019-05-02 05:31:15.490
4,2019-05-01 19:51:48.433,Bird,BRD1099,Powered4F9XY,9.0,2624.67200,2019-05-01,19:44:03.386666,2019-05-01,19:53:15.416666,36.161600,-86.776100,36.167300,-86.776900,"[(36.161544, -86.775889), (36.161871, -86.7761...",2019-05-02 05:31:15.460
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5267,2019-07-31 21:49:05.543,SPIN,SPI160,Powered5919776,24.0,3064.30456,2019-07-31,21:23:04,2019-07-31,21:46:55,36.158925,-86.777363,36.164323,-86.769406,"[(36.16431, -86.76942), (36.16432338926225, -8...",2019-08-01 11:36:28.823
5268,2019-07-31 21:50:01.907,Bird,BRD1394,Powered23WB2,11.0,6233.59600,2019-07-31,21:39:05.333333,2019-07-31,21:50:14.313333,36.156300,-86.766900,36.164200,-86.777800,"[(36.156344, -86.766776), (36.156573, -86.7667...",2019-08-01 05:31:17.507
5269,2019-07-31 21:50:01.907,Bird,BRD1395,PoweredGHW3B,22.0,3280.84000,2019-07-31,21:29:47.450000,2019-07-31,21:51:56.606666,36.162400,-86.778200,36.154400,-86.779700,"[(36.162478, -86.77814), (36.162338, -86.77855...",2019-08-01 05:31:17.540
5270,2019-07-31 21:50:01.907,Bird,BRD1393,Powered8JW3L,10.0,0.00000,2019-07-31,21:40:07.866666,2019-07-31,21:50:27.720000,36.142900,-86.800100,36.138900,-86.794000,"[(36.142995, -86.800081), (36.142896, -86.8000...",2019-08-01 05:31:17.477
5271,2019-07-31 21:50:01.907,Bird,BRD1387,PoweredPGT9N,4.0,0.00000,2019-07-31,21:46:47.876666,2019-07-31,21:50:19.756666,36.157800,-86.784400,36.158000,-86.783800,"[(36.157878, -86.784226), (36.15823, -86.7835)...",2019-08-01 05:31:17.297

2. According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:  
* Removal of staff servicing and test trips  
* Removal of trips below one minute  
* Trip lengths are capped at 24 hours  
Are the scooter companies in compliance with the second and third part of this rule?

In [19]:
TRIPSCOOTER = '''
SELECT 'OVER 24 HRS' STATUS, UPPER(companyname) COMPANYNAME
FROM TRIPS
WHERE tripduration > 1440
GROUP BY companyname
UNION
SELECT 'UNDER 1 MINUTE' STATUS, UPPER(companyname) COMPANYNAME
FROM TRIPS
WHERE tripduration < 1
GROUP BY companyname
ORDER BY status,companyname
'''
scooterstriptime= pd.read_sql_query(TRIPSCOOTER, engine)
scooterstriptime

           status    companyname
0     OVER 24 HRS  BOLT MOBILITY
1     OVER 24 HRS           LYFT
2     OVER 24 HRS           SPIN
3  UNDER 1 MINUTE           BIRD
4  UNDER 1 MINUTE           LIME
5  UNDER 1 MINUTE           LYFT